In [0]:
import pandas as pd

## Syntax – Creating DataFrames

In [4]:
## Specify values for each column.
df1 = pd.DataFrame({"a" : [4 ,5, 6],
                   "b" : [7, 8, 9],
                   "c" : [10, 11, 12]},
                  index = [1, 2, 3])
df1

   a  b   c
1  4  7  10
2  5  8  11
3  6  9  12

In [5]:
## Specify values for each row.
df2 = pd.DataFrame([[4, 7, 10],
                    [5, 8, 11],
                    [6, 9, 12]],
                   index=[1, 2, 3],
                   columns=['a', 'b', 'c'])

df2

   a  b   c
1  4  7  10
2  5  8  11
3  6  9  12

In [6]:
## Create DataFrame with a MultiIndex

df3 = pd.DataFrame({"a" : [4 ,5, 6],
                    "b" : [7, 8, 9],
                    "c" : [10, 11, 12]},
                   index = pd.MultiIndex.from_tuples([('d',1),('d',2),('e',2)],
                                                     names=['n','v']))

df3

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 2  6  9  12

## Method Chaining

In [8]:
 ## Most pandas methods return a DataFrame so that another pandas method can be applied to the result. This improves readability of code.

df4 = (pd.melt(df3).rename(columns={'variable' : 'var', 
                                   'value' : 'val'}).query('val >= 200'))
df4

Empty DataFrame
Columns: [var, val]
Index: []

## Reshaping Data – Change the layout of a data set

In [20]:
## Gather columns into rows.

print(df1)

df5 = pd.melt(df1)
df5

   a  b   c
1  4  7  10
2  5  8  11
3  6  9  12

  variable  value
0        a      4
1        a      5
2        a      6
3        b      7
4        b      8
5        b      9
6        c     10
7        c     11
8        c     12

In [21]:
## Spread rows into columns.

df6 = df5.pivot(columns='variable', values='value')
df6

variable    a    b     c
0         4.0  NaN   NaN
1         5.0  NaN   NaN
2         6.0  NaN   NaN
3         NaN  7.0   NaN
4         NaN  8.0   NaN
5         NaN  9.0   NaN
6         NaN  NaN  10.0
7         NaN  NaN  11.0
8         NaN  NaN  12.0

In [23]:
## Append rows of DataFrames

print(df1)

print(df2)

pd.concat([df1,df2])

   a  b   c
1  4  7  10
2  5  8  11
3  6  9  12
   a  b   c
1  4  7  10
2  5  8  11
3  6  9  12

   a  b   c
1  4  7  10
2  5  8  11
3  6  9  12
1  4  7  10
2  5  8  11
3  6  9  12

In [24]:
## Append columns of DataFrames

pd.concat([df1,df2], axis=1)

   a  b   c  a  b   c
1  4  7  10  4  7  10
2  5  8  11  5  8  11
3  6  9  12  6  9  12

In [0]:
df.sort_values('mpg')
#Order rows by values of a column (low to high).

df.sort_values('mpg',ascending=False)
#Order rows by values of a column (high to low).

df.rename(columns = {'y':'year'})
#Rename the columns of a DataFrame

df.sort_index()
#Sort the index of a DataFrame

df.reset_index()
#Reset index of DataFrame to row numbers, moving index to columns.

df.drop(columns=['Length','Height'])
#Drop columns from DataFrame

## Subset Observations (Rows)

In [0]:
df[df.Length > 7]
#Extract rows that meet logical criteria.

df.drop_duplicates()
#Remove duplicate rows (only considers columns).

df.head(n)
#Select first n rows.

df.tail(n)
#Select last n rows.

df.sample(frac=0.5)
#Randomly select fraction of rows.

df.sample(n=10)
#Randomly select n rows.

df.iloc[10:20]
#Select rows by position.

df.nlargest(n, 'value')
#Select and order top n entries.

df.nsmallest(n, 'value')
#Select and order bottom n entries.

df.column.isin(values) #Group membership

pd.isnull(obj) #Is NaN

pd.notnull(obj) #Is not NaN

## Subset Variables (Columns)

In [0]:
df[['width','length','species']]
#Select multiple columns with specific names.

df['width'] or df.width
#Select single column with specific name.

df.filter(regex='regex')
#Select columns whose name matches regular expression regex.

In [0]:
# regex (Regular Expressions) Examples

# '\.' Matches strings containing a period '.'
#'Length$' Matches strings ending with word 'Length'
# '^Sepal' Matches strings beginning with the word 'Sepal'
# '^x[1-5]$' Matches strings beginning with 'x' and ending with 1,2,3,4,5
# '^(?!Species$).*' Matches strings except the string 'Species'

In [0]:
df.loc[:,'x2':'x4']
#Select all columns between x2 and x4 (inclusive).

df.iloc[:,[1,2,5]]
#Select columns in positions 1, 2 and 5 (first column is 0).

df.loc[df['a'] > 10, ['a','c']]
#Select rows meeting logical condition, and only the specific columns .

## Summarize Data

In [0]:
df['w'].value_counts()
#Count number of rows with each unique value of variable

len(df)
# of rows in DataFrame.

df['w'].nunique()
# of distinct values in a column.

df.describe()
#Basic descriptive statistics for each column (or GroupBy)

In [0]:
## pandas provides a large set of summary functions that operate on
## different kinds of pandas objects (DataFrame columns, Series,
## GroupBy, Expanding and Rolling (see below)) and produce single
## values for each of the groups. When applied to a DataFrame, the
## result is returned as a pandas Series for each column. Examples:

sum()
#Sum values of each object.

count()
#Count non-NA/null values of each object.

median()
#Median value of each object.

quantile([0.25,0.75])
#Quantiles of each object.

apply(function)
#Apply function to each object.

min()
#Minimum value in each object.

max()
#Maximum value in each object.

mean()
#Mean value of each object.
var()
#Variance of each object.

std()
#Standard deviation of each object.

In [25]:
df2.sum()

a    15
b    24
c    33
dtype: int64

In [26]:
df3.quantile([0.25,0.75])

        a    b     c
0.25  4.5  7.5  10.5
0.75  5.5  8.5  11.5

## Handling Missing Data

In [0]:
df.dropna()
## Drop rows with any column having NA/null data.

df.fillna(value)
## Replace all NA/null data with value.

## Make New Columns

In [0]:
df.assign(Area=lambda df: df.Length*df.Height)
##Compute and append one or more new columns.

df['Volume'] = df.Length*df.Height*df.Depth
##Add single column.

pd.qcut(df.col, n, labels=False)
##Bin column into n buckets.

In [0]:
## pandas provides a large set of vector functions that operate on all
## columns of a DataFrame or a single selected column (a pandas
## Series). These functions produce vectors of values for each of the
## columns, or a single Series for the individual Series. Examples:

max(axis=1)
#Element-wise max.

clip(lower=-10,upper=10)
#Trim values at input thresholds

min(axis=1)
#Element-wise min.

abs()
#Absolute value

In [30]:
df1['max'] = df1.max(axis=1)
df1

   a  b   c  max
1  4  7  10   10
2  5  8  11   11
3  6  9  12   12

In [31]:
df1.abs()

   a  b   c  max
1  4  7  10   10
2  5  8  11   11
3  6  9  12   12

## Group Data

In [0]:
df.groupby(by="col")
#Return a GroupBy object, grouped by values in column named "col".

df.groupby(level="ind")
#Return a GroupBy object, grouped by values in index level named "ind".

#All of the summary functions listed above can be applied to a group.
#Additional GroupBy functions:

size()
#Size of each group.

agg(function)
#Aggregate group using function.

shift(1)
#Copy with values shifted by 1.

rank(method='dense')
#Ranks with no gaps.

rank(method='min')
#Ranks. Ties get min rank.

rank(pct=True)
#Ranks rescaled to interval [0, 1].

rank(method='first')
#Ranks. Ties go to first value.

shift(-1)
#Copy with values lagged by 1.

cumsum()
#Cumulative sum.

cummax()
#Cumulative max.

cummin()
#Cumulative min.

cumprod()
#Cumulative product.

## Windows

In [0]:
df.expanding()
## Return an Expanding object allowing summary functions to be applied cumulatively.

df.rolling(n)
## Return a Rolling object allowing summary functions to be applied to windows of length n.

## Plotting

In [0]:
df.plot.hist()
##Histogram for each column

df.plot.scatter(x='w',y='h')
##Scatter chart using pairs of points

## Combine Data Sets

In [0]:
pd.merge(adf, bdf, how='left', on='x1')
#Join matching rows from bdf to adf

pd.merge(adf, bdf, how='right', on='x1')
#Join matching rows from adf to bdf.

pd.merge(adf, bdf, how='inner', on='x1')
#Join data. Retain only rows in both sets.

pd.merge(adf, bdf, how='outer', on='x1')
#Join data. Retain all values, all rows

adf[adf.x1.isin(bdf.x1)]
#All rows in adf that have a match in bdf.

adf[~adf.x1.isin(bdf.x1)]
#All rows in adf that do not have a match in bdf.